Revit 2026 API

# ImageTypeOptionsSourceType Property

---

Indicates whether the image type is a link or an import.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ImageTypeSource SourceType { get; set; }
```
```vb
Public Property SourceType As ImageTypeSource
	Get
	Set
```
```cpp
public:
property ImageTypeSource SourceType {
	ImageTypeSource get ();
	void set (ImageTypeSource value);
}
```
```fsharp
member SourceType : ImageTypeSource with get, set
```

#### Property Value

ImageTypeSource

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The ImageType source is not correct. Only Link or Import values are allowed. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Use this property with the method ImageType::Create to create a linked image type. Use this property with the method ImageType::ReloadFrom to convert an import image type to a link and vice versa. Valid values are 'Import' and 'Link'.

#### Reference

ImageTypeOptions Class

Autodesk.Revit.DB Namespace